# -*- coding: utf-8 -*-
"""Created on Tue Nov 7 22:48:30 2017  @author: Egor """
SPACE = '      '  #\u0020' #символ проба в юникоде
LIST_ALL_FIGURES = [' Т(ч) ', ' К(ч) ', ' С(ч) ', ' Ф(ч) ', 'Кор(ч)', ' П(ч) ',
                    ' Т(б) ', ' К(б) ', ' С(б) ', ' Ф(б) ', 'Кор(б)', ' П(б) ']
V = '-'
L0 = [' ', '  a   ', '  b   ', '  c   ', '   d  ', '   e  ', '  f   ', '  g  ', '   h   ']
L1 = [8, ' Т(ч) ', ' К(ч) ', ' С(ч) ', ' Ф(ч) ', 'Кор(ч)', ' С(ч) ', ' К(ч) ', ' Т(ч) ']
L2 = [7, ' П(ч) ', ' П(ч) ', ' П(ч) ', ' П(ч) ', ' П(ч) ', ' П(ч) ', ' П(ч) ', ' П(ч) ']
L3 = [6, '      ', '      ', '      ', '      ', '      ', '      ', '      ', '      ']
L4 = [5, '      ', '      ', '      ', '      ', '      ', '      ', '      ', '      ']
L5 = [4, '      ', '      ', '      ', '      ', '      ', '      ', '      ', '      ']
L6 = [3, '      ', '      ', '      ', '      ', '      ', '      ', '      ', '      ']
L7 = [2, ' П(б) ', ' П(б) ', ' П(б) ', ' П(б) ', ' П(б) ', ' П(б) ', ' П(б) ', ' П(б) ']
L8 = [1, ' Т(б) ', ' К(б) ', ' С(б) ', ' Ф(б) ', 'Кор(б)', ' С(б) ', ' К(б) ', ' Т(б) ']
BOARD = [L0, L1, L2, L3, L4, L5, L6, L7, L8]

if __name__ == "__main__":
    print("This is a module with game Chess.")
    input("\nPress the enter key to exit.")
